<?php

include_once 'forms.php';
return
[
    //////////////////////////STAGE 1 Cards/////////////////////////////////////
    //desk 1_1
    //

    'card1_1_1'=> new CardInit('Заполнение детальной анкеты', $form1_1_1, ['task1_1_1'], [],//заполнение анкеты
            [
                'card1_1_2',//подписание ДКК
                'card1_1_3',//подписание договора поставки
                'card1_1_4',//договор услуг
                'card1_1_5',//договор сервиса
            ]),

    'card1_1_2'=> new CardInit('Подписание договора комерческой концессии',$form1_1_2, ['task1_1_2'],//подписание дкк
            [
                'card1_1_1'//заполнение анкеты
            ],
            [
                'card1_1_6',//оплата поушального взноса
            ]),

    'card1_1_3'=> new CardInit('Подписание договора поставки',$form1_1_3, ['task1_1_3'],//подписание договора поставки
            [
                'card1_1_1'//заполнение анкеты
            ],
            [

            ]),

    'card1_1_4'=> new CardInit('Подписание договора услуг',$form1_1_4, ['task1_1_4'],//подписание договора услуг
            [
                'card1_1_1'//заполнение анкеты
            ],
            [

            ]),

    'card1_1_5'=> new CardInit('Подписание договора сервиса',$form1_1_5, ['task1_1_5'],//подписание договора сервиса
            [
                'card1_1_1'//заполнение анкеты
            ],
            [

            ]),

    'card1_1_6'=> new CardInit('Оплата поушального взноса',$form1_1_6, ['task1_1_6'],//оплата поушального взноса
            [
                'card1_1_2'//Подписание ДКК
            ],
            [

            ]),




    //////////////////////////STAGE 2 Cards/////////////////////////////////////
    //desk2_1

            'card2_1_1'=> new CardInit('Данные по объекту',$form2_1_1, ['task2_1_1_1','task2_1_1_2'],//данные по объекту+подтверждение!!!!!!!!!!!!!
            [

            ],
            [
                    'card2_1_2'
            ]),

            'card2_1_2'=> new CardInit('Договор аренды',$form2_1_2, ['task2_1_2'],//
            [
                   'card2_1_1'
            ],
            [

            ]),





      //////////////////////////STAGE 3 Cards/////////////////////////////////////
      //desk 3_1

    'card3_1_1'=> new CardInit('Подбор управляющего магазином',$form3_1_1, ['task3_1_1'],//подбор ум
            [

            ],
            [
                'card3_1_5',//обучение ум
            ]),



    'card3_1_2'=> new CardInit('Обучение управляющего магазином',$form3_1_2, ['task3_1_2'],//обучение ум
            [
                'card3_1_5'
            ],

            [

                'card3_3_9',//выкладка
            ]),




    'card3_1_3'=> new CardInit('Подбор линейного персонала',$form3_1_3, ['task3_1_3'],//подбор ЛП
            [

            ],
            [
                'card3_1_6',//обучение ЛП
            ]),




    'card3_1_4'=> new CardInit('Обучение линейного персонала',$form3_1_4, ['task3_1_4'],//обучение лп
            [
                'card3_1_6'
            ],
            [
                'card3_3_9',//выкладка
            ]),

       'card3_1_5'=> new CardInit('Найм управляющего',$form3_1_5, ['task3_1_5'],//обучение лп
            [
                'card3_1_1'//подбор л
            ],
            [
                'card3_3_2',//выкладка
                'card3_1_7',//выкладка
            ]),


       'card3_1_6'=> new CardInit('Найм линейного персонала',$form3_1_6, ['task3_1_6'],//обучение лп
            [
                'card3_1_3'//подбор лп
            ],
            [
                'card3_1_4',
                'card3_1_7',
            ]),


       'card3_1_7'=> new CardInit('Заказ формы для персонала',$form3_1_7, ['task3_1_7'],//обучение лп
            [
                'card3_1_6',
                'card3_1_5',
            ],
            [

            ]),



    //desk3_2

    'card3_2_1'=> new CardInit('Ремонт помещения',$form3_2_1, ['task3_2_1'], //ремонт помещзениея + гайдбук
            [
                'card3_3_4'//зонирование
            ],
            [
                'card3_2_2',//клининг
            ]),




    'card3_2_2'=> new CardInit('Клининг',$form3_2_2, ['task3_2_2'], //клининг
            [
                'card3_2_1'//ремонт помещения+гайдбук
            ],
            [
                'card3_3_3',//сборка и расстоновка то
            ]),




    'card3_2_3'=> new CardInit('Вывеска',$form3_2_3, ['task3_2_3'], //вывеска
            [

            ],
            [

            ]),




    'card3_2_4'=> new CardInit('Навигация',$form3_2_4, ['task3_2_4'], //навигация
            [

            ],
            [

            ]),




    'card3_2_5'=> new CardInit('Внутреннее оформление',$form3_2_5, ['task3_2_5'], //внутреннее оформление
            [

            ],
            [
                 'card3_3_3',//сборка и расстоновка то

            ]),




//desk3_3

    'card3_3_1'=> new CardInit('Заказ торгоборудования',$form3_3_1, ['task3_3_1'], //заказ торгоборудавания
            [
                'card3_3_14',//Планировка магазина
            ],
            [
                'card3_3_2',//оплата торгоборудования
            ]),




    'card3_3_2'=> new CardInit('Оплата торгоборудования',$form3_3_2, ['task3_3_2'], //оплата торгоборудования
            [
                'card3_3_1',//заказ торгоборудования

            ],
            [
                'card3_3_3',//сборка и расстаноовка то
            ]),




    'card3_3_3'=> new CardInit('Сборка и расстановка торгоборудования',$form3_3_3, ['task3_3_3'], //сборка и расстаноовка то
            [
                'card3_3_2',//заказ торгоборудования
                'card3_2_2',//Клиннинг

            ],
            [
                'card3_2_5',//внутреннее оформление
            ]),

    //




    'card3_3_4'=> new CardInit('Зонирование',$form3_3_4, ['task3_3_4'], //зонирование
            [

                 'card3_3_14',//планировка магазина
            ],
            [
                'card3_3_5',//Установочный заказ
                'card3_4_1',//Антикражка
                'card3_2_1',//Клиннинг
            ]),




    'card3_3_5'=> new CardInit('Установочный заказ',$form3_3_5, ['task3_3_5'], //установочный заказ
            [
                'card3_3_4', //зонирование

            ],
            [
                'card3_3_6',//Заказ товара под листовку
            ]),




    'card3_3_6'=> new CardInit('Заказ товара под листовку',$form3_3_6, ['task3_3_6'], //Заказ товара под листовку
            [
                'card3_3_5',//установочный заказ

            ],
            [
                'card3_5_1',//подготовка листовки
                'card3_3_12',//подготовка цен для партнера
                'card3_3_7',//оплата заказа
            ]),


    ////




    'card3_3_7'=> new CardInit('Оплата заказа',$form3_3_7, ['task3_3_7'], //оплата заказа
            [
                'card3_3_6', //Заказ товара под листовку

            ],
            [
                'card3_3_8',//Приемка товара
            ]),



    'card3_3_8'=> new CardInit('Приемка товара',$form3_3_8, ['task3_3_8'], //приемка товаров
            [
                'card3_3_7', //оплата заказа

            ],
            [
                'card3_3_9',//Выкладка
            ]),



    'card3_3_9'=> new CardInit('Выкладка',$form3_3_9, ['task3_3_9'], //Выкладка
            [
                'card3_3_8', //Приемка товара
                'card3_1_2', //обучение ум
                'card3_1_4', //ОБУЧЕНИЕ лп

            ],
            [
                'card3_3_10',//Расстановка ценников
            ]),



    'card3_3_10'=> new CardInit('Расстановка ценников',$form3_3_10, ['task3_3_10'], //Расстановка ценников
            [
                'card3_3_9', //Выкладка
                'card3_3_13', //Установка цен в базе партнера

            ],
            [
                'card3_3_11',//Клинннинг
            ]),



    'card3_3_11'=> new CardInit('Клининг',$form3_3_11, ['task3_3_11'], //Клиннинг
            [
                'card3_3_10', //Расстановка ценников

            ],
            [

            ]),



    'card3_3_12'=> new CardInit('Подготовка цен для партнера',$form3_3_12, ['task3_3_12'], //Подготовка цен для партнера
            [
                'card3_3_6', //Заказ товара под листовку

            ],
            [
                'card3_3_13',//Установка цен в базе партнера
            ]),



    'card3_3_13'=> new CardInit('Установка цен в базе партнера',$form3_3_13, ['task3_3_13'], //установочный цен в базе партнера
            [
                'card3_3_12', //Подготовка цен для партнера

            ],
            [
                'card3_3_10',//Расстановка ценников
            ]),


     'card3_3_14'=> new CardInit('Планировка',$form3_3_14, ['task3_3_14'], //планировка
            [

            ],
            [
                'card3_3_1',//Заказторгоборуд
                'card3_3_4',//Зонирование
            ]),


    //////desk3_4




    'card3_4_1'=> new CardInit('Заказ антикражной системы',$form3_4_1, ['task3_4_1'], //Заказ антикражки+расходники
            [
                'card3_3_12', //зонирование

            ],
            [
                'card3_3_10',//оплата антикражки
            ]),




    'card3_4_2'=> new CardInit('Оплата антикражной системы',$form3_4_2, ['task3_4_2'], //Оплата антикражки+расходники
            [
                'card3_3_12', //заказ антикражки

            ],
            [
                'card3_3_10',//монтаж антикражки
            ]),




    'card3_4_3'=> new CardInit('Монтаж антикражной системы',$form3_4_3, ['task3_4_3'], //монтаж антикражки+расходники
            [
                'card3_3_12', //Оплата антикражки

            ],
            [

            ]),


    /////



    'card3_4_4'=> new CardInit('Кассы',$form3_4_4, ['task3_4_4'], //Кассы
            [
                'card3_3_12', //зонирование

            ],
            [

            ]),




    'card3_4_5'=> new CardInit('Эквайринг',$form3_4_5, ['task3_4_5'], //Эквайринг
            [
                'card3_3_12', //зонирование

            ],
            [

            ]),




    'card3_4_6'=> new CardInit('Инкасация',$form3_4_6, ['task3_4_6'], //Инкасации
            [
                'card3_3_12', //зонирование

            ],
            [

            ]),




    'card3_4_7'=> new CardInit('Заказ видеонаблюдения',$form3_4_7, ['task3_4_7'], //Видеонаблюдение заказ
            [
                'card3_3_12', //зонирование

            ],
            [
                'card3_3_10',//оплата видеонаблюдения
            ]),




    'card3_4_8'=> new CardInit('Оплата видеонаблюдения',$form3_4_8, ['task3_4_8'], //Оплата видеонаблюдения
            [
                'card3_3_12', //Видеонаблюдение заказ

            ],
            [
                'card3_3_10',//Монтаж видеонаблюдения
            ]),




    'card3_4_9'=> new CardInit('Монтаж видеонаблюдения',$form3_4_9, ['task3_4_9'], //Монтаж видеонаблюдения
            [
                'card3_3_12', //Оплата видеонаблюдения

            ],
            [

            ]),
    ///




    'card3_4_10'=> new CardInit('Печати и штампы',$form3_4_10, ['task3_4_10'], //Печати и штампы
            [


            ],
            [

            ]),



    ///





    'card3_4_11'=> new CardInit('ИТ инфраструктура',$form3_4_11, ['task3_4_11'], //ИТ инфраструктура
            [


            ],
            [
                'card3_3_10',//Наличие интернете
            ]),




    'card3_4_12'=> new CardInit('Интернет',$form3_4_12, ['task3_4_12'], //Наличие интернета
            [
                'card3_3_12', //Ит инфраструктура

            ],
            [
                'card3_3_10',//Покупка оргтехники
            ]),




    'card3_4_13'=> new CardInit('Покупка оргтехники',$form3_4_13, ['task3_4_13'], //Покупка оргтехники
            [
                'card3_3_12', //Наличие интрнета

            ],
            [
                'card3_3_10',//Найстройка рабочих мест и сети
            ]),




    'card3_4_14'=> new CardInit('Настройка сети и рабочих мест',$form3_4_14, ['task3_4_14'], //Настройка рабочих мест и сети
            [
                'card3_3_12', //покупка оргтехники

            ],
            [
                'card3_3_10',//настрйока базы
            ]),




    'card3_4_15'=> new CardInit('Настройка базы ',$form3_4_15, ['task3_4_15'], //Настройка базы
            [
                'card3_3_12', //Настройка раб мест и сети

            ],
            [
                'card3_3_10',//Тестирование ИТ систем
            ]),




    'card3_4_16'=> new CardInit('Тестирование ИТ систем',$form3_4_16, ['task3_4_16'], //Тестирование ИТ систем
            [
                'card3_3_12', //Настройка базы

            ],
            [

            ]),

    ///desk3_5





    'card3_5_1'=> new CardInit('Подготовка листовок',$form3_5_1, ['task3_5_1'], //Подготовка листовок
            [
                'card3_3_12', //Заказ товара под листовку

            ],
            [

            ]),





    'card3_5_2'=> new CardInit('Сценарий',$form3_5_2, ['task3_5_2'], //Сценарий
            [


            ],
            [
                'card3_3_10',//Оплата подрядчику
            ]),





    'card3_5_3'=> new CardInit('Оплата подрядчику',$form3_5_3, ['task3_5_3'], //Оплата подрядчику
            [
                'card3_3_12', //Сценарий

            ],
            [

            ]),

          //////////////////////////STAGE 4 Cards/////////////////////////////////////

'card4_1_1'=> new CardInit('Чек лист',$form4_1_1, ['task4_1_1'], //Чек лист
            [


            ],
            [

            ]),

];