<?php


return
[
    //////////////////////////STAGE 1 Desks/////////////////////////////////////

    'desk1_1'=>new DeskInit('Договора',
            [
                'card1_1_1',//заполение анкеты, проверяет служба безопасности
                'card1_1_2',//подписание ДКК
                'card1_1_3',//подписание договора поставки
                'card1_1_4',//договор услуг
                'card1_1_5',//договор сервиса
                'card1_1_6',//оплата взноса
            ]),



    //////////////////////////STAGE 2 Desks/////////////////////////////////////

    'desk2_1'=>new DeskInit('Согласование объекта и проекта',
            [
                'card2_1_1',//данные по объекту, подтверждение
                'card2_1_2',//договор аренды
            ]),



    //////////////////////////STAGE 3 Desks/////////////////////////////////////



      'desk3_1'=>new DeskInit('Персонал',
              [
                  'card3_1_1',//подбор УМ
                  'card3_1_2',//обучение Ум

                  'card3_1_3',//подбор линейного
                  'card3_1_4',//обучение линейного


                  'card3_1_5',//найм управляющего
                  'card3_1_6',//найм  линейного
                  'card3_1_7',//униформа
              ]),



      'desk3_2'=>new DeskInit('Ремонт и оформление',
              [
                  'card3_2_1',//ремонт помещения + гуидбук
                  'card3_2_2',//Клининг

                  'card3_2_3',//Вывеска
                  'card3_2_4',//Навигация в ТЦ
                  'card3_2_5',//Внутреннее оформление магазина
              ]),



      'desk3_3'=>new DeskInit('Товар и оборудование',
              [
                  'card3_3_1',//Заказ торгоборудвания
                  'card3_3_2',//оплата торгоборудования
                  'card3_3_3',//Сборка и расстановка ТО

                  'card3_3_4',//Зонирование
                  'card3_3_5',//Установочный заказ
                  'card3_3_6',//заказ товара под листовку
                  //
                  'card3_3_7',//оплата заказа
                  'card3_3_8',//приемка товара
                  'card3_3_9',//выкладка
                  'card3_3_10',//расстоновка ценников
                  'card3_3_11',//клининг
                  'card3_3_12',//Подготовка цен для партнера
                  'card3_3_13',//Установка цен в база партнер
                  'card3_3_14', // планирвока магазина - технолог
              ]),



      'desk3_4'=>new DeskInit('Оргтехника, IT, Антикражное оборудование',
              [
                  'card3_4_1',//Заказ антикражки
                  'card3_4_2',//Оплата антикражки
                  'card3_4_3',//Монтаж антикражки

                  'card3_4_4',//Кассы
                  'card3_4_5',//Эквайринг
                  'card3_4_6',//Инкасаци

                  'card3_4_7',//Видеонаблюдение
                  'card3_4_8',//Оплата видеонаблюдения
                  'card3_4_9',//установка видеонаблюдения

                  'card3_4_10',//Печати и штампы

                  'card3_4_11',//Ит инфраструктура
                  'card3_4_12',//наличие интернета
                  'card3_4_13',//покупка оргтехники
                  'card3_4_14',//настройка рабочих мест и сети
                  'card3_4_15',//настройка базы
                  'card3_4_16',//тестирование ит систем
              ]),



      'desk3_5'=>new DeskInit('Праздничное открытие',
              [
                  'card3_5_1',//подготовка листовки


                  'card3_5_1',//Сценарий
                  'card3_5_1',//Оплата подрядчику
              ]),



    //////////////////////////STAGE 4 Desks/////////////////////////////////////
      'desk4_1'=>new DeskInit('Открытие',
              [
                  'card4_1_1',//Чек лист
              ]),
];